/*
 * @Author: 天火流光
 * @Date: 2022-03-12 21:22:45
 * @LastEditTime: 2022-03-12 23:44:56
 * @LastEditors: 天火流光
 * @Description:
 * @FilePath: \paradise-admin\src\utils\gamepad.ts
 *
 */
import { Event } from '@/utils/public/event'
// https://w3c.github.io/gamepad/#abstract
// 按钮[0]	右侧集群中的底部按钮
// 按钮[1]	右侧集群中的右键
// 按钮[2]	右侧集群中的左侧按钮
// 按钮[3]	右侧集群中的顶部按钮
// 按钮[4]	左上前按钮
// 按钮[5]	右上角前按钮
// 按钮[6]	左下前按钮
// 按钮[7]	右下前按钮
// 按钮[8]	中央集群中的左按钮
// 按钮[9]	中央集群中的右键
// 按钮[10]	左摇杆按下按钮
// 按钮[11]	右摇杆按下按钮
// 按钮[12]	左侧集群中的顶部按钮
// 按钮[13]	左侧集群中的底部按钮
// 按钮[14]	左侧集群中的左侧按钮
// 按钮[15]	左集群中的右键
// 按钮[16]	中心集群中的中心按钮
// 轴[0]	左摇杆的水平轴（负左/正右）
// 轴[1]	左摇杆垂直轴（负向上/正向下）
// 轴[2]	右摇杆的水平轴（负左/正右）
// 轴[3]	右摇杆纵轴（负向上/正向下）

class GamepadMap extends Event {
	constructor() {
		super()
		//
	}
}
